class biblio(object):
    def __init__(self, sourse: str) -> None:   #source - Источник вид [n] text      Под [n] может быть и n. Если цифры нету до уже можно считать некоректным (хотя это надо проверить)
        pass
    def __init_subclass__(cls) -> None:
        pass

#В будущем всё внизу удалим это просто быстрая шпаргалка

#Описание книги с 1 автором
#На иностранном языке

#Первушкин, В. И. Губернские статистические комитеты и провинциальная историческая наука / В. И. Первушкин. – Пенза: ПГПУ, 2007. – 214 с.

#Фамилия, И. О. Название / И. О. Фамилия. - Город:Издательство, год. - размерность с.


#Описание книги с 2-4 авторами

#Ставицкий, В. В. Неолит – ранний энеолит лесостепного Посурья и Прихоперья / В.В. Ставицкий, А.А. Хреков. – Саратов: Изд-во Сарат. ун-та, 2003 (Тип. Изд-ва). – 166 с.

# Фамилия, И. О. (Главного автора) Название / И. О. Фамилия, И. О. Фамилия. ([и др.] (по необходимости)) - Город: Издательство, год. - размерность с.


# #Описание книги под редакцией

# Философия истории: Учеб. пособие для студентов вузов, обучающихся по гуманит. спец. и направлениям / [А. С. Панарин и др.]; под ред. А. С. Панарина. – Москва: Гардарики, 1999. – 431 с.

# Название / [И. О. Фамилия]; под ред. И. О. Фамилия. - Город:Издательство, год. - размерность с.


# #Справочник

# Год за годом: Хроника важнейших событий общественной жизни Пензенской области за 50 лет / Сост. В. С. Годин, Е. Я. Дмитров, В. А. Озерская, А. В. Сергеев, А. П. Сташова. – Саратов–Пенза: Приволжское книжное издательство, 1967. – 175 с.

# Название / Сост. И. О. Фамилия, (и т.д). - Город:Издательство, год. - размерность с.



# #Описание статьи с 1-4 авторами

# Власов, В. А. Выселение раскулаченных крестьян Пензенского края / В. А. Власов, А. В. Тишкина // Известия Пензенского государственного педагогического университета им. В.Г. Белинского. Гуманитарные науки. – 2011. – № 23. – С. 338-344.

# Фамилия, И. О. Название / И. О. Фамилия, (и т.д.) // Журнал - год. - №Тиража - С. Страница(ы)


# #Описание статьи из сборника материалов научной конференции

# Кондрашин, В. В. Люди во времени: Л. Б. Ермин и его команда / В. В. Кондрашин // Городское пространство в исторической ретроспективе: материалы Всерос. науч.-практ. конф., посвящ. 350-летию основания города Пензы / под общ. ред. О. А. Суховой. – Пенза: ГУМНИЦ ПГУ, 2013. – С. 62–65.

# Фамилия, И. О. Название: И. О. Фамилия и его команда / И. О. Фамилия // Название: материалы Название конференции / под общ. ред. И. О. Фамилия. - Город: Издательство, Год. - С. Страница(ы).


# #Статья из газеты:

# Хохрякова, С.  Просто жить: итоги кинофестиваля «Сталкер» / С. Хохрякова // Культура. – 2010. – 23 дек. – С. 8.

# Фамилия, И. О. Заголовок статьи / И. О. Фамилия // Название журнала. - Год. - Дата выпуска. - С. Страница(ы).


# #Описание электронного ресурса





# #Описание ресурса Интернет (сайта)





# #Статьи с сайтов




# #Картографические издания





# #Видеоиздания





# #Аудиоиздания




#