class biblio(object):
    def __init__(self) -> None:
        pass
    def __init_subclass__(cls) -> None:
        pass

#Описание книги с 1 автором
#На иностранном языке
#Описание книги с 2 авторами
#Описание книги с 3 авторами
#Описание книги с 4 авторами
#Описание книги под редакцией
#Справочник
#Описание статьи с 1 автором
#Описание статьи с 2 авторами
#Описание статьи с 3 авторами
#Описание статьи с 4 авторами
#Описание статьи из сборника материалов научной конференции
#Статья из газеты:
#Законодательные материалы
#Описание электронного ресурса
#Описание ресурса Интернет (сайта)
#Статьи с сайтов