# 5.1.2 На титульном листе приводят следующие сведения:
# а) наименование министерства (ведомства) или другого структурного образования, в систему которого входит
# организация-исполнитель;
# б) наименование (полное и сокращенное) организации - исполнителя НИР;
# в) индекс Универсальной десятичной классификации (УДК) по ГОСТ 7.90;
# г) номера, идентифицирующие отчет:

# Цвет шрифта должен быть черным, размер шрифта - не менее 12 пт. Рекомендуемый тип шрифта
# для основного текста отчета - Times New Roman. Полужирный шрифт применяют только для заголовков разделов и подразделов,
# заголовков структурных элементов. Использование курсива допускается для обозначения объектов (биология, геология,
# медицина, нанотехнологии, генная инженерия и др.) и написания терминов (например, in vivo, in vitro) и иных объектов и
# терминов на латыни.

# Текст отчета следует печатать, соблюдая следующие размеры полей: левое - 30 мм, правое - 15 мм, верхнее и нижнее - 20
# мм. Абзацный отступ должен быть одинаковым по всему тексту отчета и равен 1,25 см.

import nltk
#text1
#text2.concordance("hello")
print (nltk.similar("world"))